# GetHatchingDirection Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid..::..GetHatchingDirection Method
FillGrid Class See Also
---
Provides the hatching propagation. Hatching is inverted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public UV GetHatchingDirection()
```

Visual Basic
---
```text
Public Function GetHatchingDirection As UV
```

Visual C++
---
```text
public:
UV^ GetHatchingDirection()
```

# ### Return Value
The direction of hatching.
# See Also
FillGrid Class
Autodesk.Revit.DB Namespace